In [218]:
# Task 1
! pip install pandas

Requirement already satisfied: pandas in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (2.2.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2024.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2024.1)
Requirement already satisfied: numpy>=1.22.4 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.0.0)
Requirement already satisfied: six>=1.5 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.0.1 -> 24.1.1
[notice] To update, run: C:\Users\kamal\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip


## Task 1: Setup and DataFrame Creation
- Install Pandas (if not already installed).
- Import Pandas and any other necessary libraries.
- Create a DataFrame from a dictionary and from a list of dictionaries.
- Load a dataset from a CSV file that is provide called `messed_dataset.csv`

In [219]:
# Creating of DataFrame
! pip install pandas

Requirement already satisfied: pandas in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (2.2.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2024.1)
Requirement already satisfied: numpy>=1.22.4 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.0.1 -> 24.1.1
[notice] To update, run: C:\Users\kamal\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [220]:
import pandas as pd

In [221]:
data2 = pd.read_csv(r"C:\Users\kamal\OneDrive\Desktop\omenda school\data-science-assignment-2-tentyap\messed_dataset.csv")
print(data2)

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

In [222]:
data = {
    
    "Name" :['kamal','sunam',"Rohan","sona"],
    "Age" : [23, 20 , 34, 15],
    "Grade" :[4,10, 5, 6]   
}

data = pd.DataFrame(data)
print(data)

    Name  Age  Grade
0  kamal   23      4
1  sunam   20     10
2  Rohan   34      5
3   sona   15      6

## Task 2: Viewing and Inspecting Data
- Display the first and last few rows of the DataFrame.
- Get a summary of the DataFrame, including basic statistics and data types.
- Display the shape and column names of the DataFrame.

In [223]:
# Display of first  row
data2.head()
print(data2)

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

In [224]:
# last data
data.tail()
print(data2)

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

In [225]:
# Get summery of the dataFrame
data2.describe()
print(data2)

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

In [226]:
# All information of Data
data.info()
print(data2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Grade   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes
                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

In [227]:
# Shape of the coloum
data2.shape
print(data2)

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

## Task 3: Selection and Indexing
- Select a single column and multiple columns.
- Select rows by index and by label.
- Select specific rows and columns using loc and iloc.

In [228]:
# selecting of single columns
data2['Name']

0                invalid
1        David Jefferson
2          Jessica Reyes
3      Kenneth Macdonald
4            Julie Horne
             ...
95      Garrett Davidson
96        Elizabeth Ross
97                   NaN
98        Patricia Singh
99    Christopher Stokes
Name: Name, Length: 100, dtype: object

In [229]:
# find the coloum from dataFrame using iloc
data2.iloc[3]

Name             Kenneth Macdonald
Age                           68.0
Email            ewolf@example.com
Country                      Italy
Salary                    84223.29
DateOfJoining           2022-04-07
Name: 3, dtype: object

In [230]:
# selecting a multiple columns
data2[['Name',"Age","Email"]]
data2

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19
...,...,...,...,...,...,...
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

In [231]:
#specfic the  indix using a loc
data2.loc[1]

Name             David Jefferson
Age                         21.0
Email                        NaN
Country                    China
Salary                       NaN
DateOfJoining         2021-10-04
Name: 1, dtype: object

In [232]:
# findig a data using rows and column using lco
data2.loc[0:2,["Name","Email"]]

              Name                Email
0          invalid  ycastro@example.org
1  David Jefferson                  NaN
2    Jessica Reyes                  NaN


## Task 4: Handling Missing Data
- Identify missing values in the DataFrame.
- Drop rows with missing values.
- Fill missing values with a specified value.

In [233]:
# Identify missing Values in the DataFrame
data2.isnull().sum()

Name             11
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64

In [234]:

# #Drop a missing  Value
# data2.dropna (inplace = True)
# print(date2)

In [235]:
# Fill missing values with a specified value.
data2.fillna(value ={'Age':40}, inplace =True)


## Task 5: Data Operations
- Add a new column to the DataFrame.
- Delete a column from the DataFrame.
- Rename columns in the DataFrame.
- Apply a function to a column.

In [236]:
# Add a new coloumn to the Data Frame
data['Name'] = ["kamal", "Rohan", "sona", "sinam"]
data['Grade'] = [4, 5, 6, 7]
data['Salary'] = [5000,70000,90000,8000]
print(data)

    Name  Age  Grade  Salary
0  kamal   23      4    5000
1  Rohan   20      5   70000
2   sona   34      6   90000
3  sinam   15      7    8000

In [237]:
# Delete a column

data.drop(columns = ["Grade"],inplace =True)
print(data)

    Name  Age  Salary
0  kamal   23    5000
1  Rohan   20   70000
2   sona   34   90000
3  sinam   15    8000

In [238]:
# Rename of Columns 

data = data.rename(columns={'Name': 'Namsu'})
print(data)

   Namsu  Age  Salary
0  kamal   23    5000
1  Rohan   20   70000
2   sona   34   90000
3  sinam   15    8000

In [239]:
#use lambda function 
data['Salary'] = data["Salary"].apply(lambda x :x+1)
data

   Namsu  Age  Salary
0  kamal   23    5001
1  Rohan   20   70001
2   sona   34   90001
3  sinam   15    8001

## Task 6: GroupBy Operations
- Group the DataFrame by a column and calculate summary statistics.
- Iterate over groups and display the group names and data.

In [240]:
#Group the DataFrame by a column and calculate summary statistics.
# Grouped by name
grouped = data.groupby("Age")
grouped

In [241]:
# calculated a mean
mean_score = grouped['Salary'].mean()
mean_score

Age
15     8001.0
20    70001.0
23     5001.0
34    90001.0
Name: Salary, dtype: float64

## Task 7: Merging and Joining DataFrames
- Merge two DataFrames on a common column.
- Join two DataFrames using their indices.

In [242]:
# Marging and joining 
# Marging and joining  # required same indixing 
data4 = pd.DataFrame({
    "c": ["c0", "c1", "c2"],
    "d": ["d0", "d1", "d2"]
}, index=['k0', 'k1', 'k2'])

print(data4)

     c   d
k0  c0  d0
k1  c1  d1
k2  c2  d2

In [243]:
# Marging and joining 
# Marging and joining 
data5= pd.DataFrame({
    "A": ["A0", "A1", "A2"],
    "B": ["B0", "B1", "B2"]
}, index=['k0', 'k1', 'k2'])

print(data5)

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [244]:
join_data = data5.join(data4)
print(join_data)

     A   B   c   d
k0  A0  B0  c0  d0
k1  A1  B1  c1  d1
k2  A2  B2  c2  d2

## Task 8: Working with Dates and Times
- Create a datetime index for the DataFrame.
- Convert a column to datetime and extract date components.

In [245]:
# create a Date time index for the data Frame
data['date'] = pd.date_range(start = '1/12/2022', periods = len(data), freq = "D")
print(data)

   Namsu  Age  Salary       date
0  kamal   23    5001 2022-01-12
1  Rohan   20   70001 2022-01-13
2   sona   34   90001 2022-01-14
3  sinam   15    8001 2022-01-15

In [246]:
#convort a coloumnt to month
data['month'] = data['date'].dt.month
print(data)

   Namsu  Age  Salary       date  month
0  kamal   23    5001 2022-01-12      1
1  Rohan   20   70001 2022-01-13      1
2   sona   34   90001 2022-01-14      1
3  sinam   15    8001 2022-01-15      1

## Task 9: Input and Output
- Read data from a CSV file into a DataFrame.
- Write the DataFrame to a CSV file.
- Read data from an Excel file into a DataFrame. The data given is `SaleData.xlsl`.
- Write the DataFrame to an Excel file.

In [249]:
# Read Data from csv file
! pip install openpyxl

xlsx_file = r"C:\Users\kamal\OneDrive\Desktop\omenda school\data-science-assignment-2-tentyap\SaleData.xlsx"
excel_data = pd.read_excel(xlsx_file)

print(excel_data)

Requirement already satisfied: openpyxl in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\kamal\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from openpyxl) (1.1.0)
    OrderDate   Region  Manager   SalesMan          Item   Units  Unit_price  \
0  2018-01-06     East   Martha  Alexander    Television   95.00    1198.000
1  2018-01-23  Central  Hermann     Shelli  Home Theater   50.00     500.000
2  2018-02-09  Central  Hermann       Luis    Television   36.00    1198.000
3  2018-02-26  Central  Timothy      David    Cell Phone   27.00     225.000
4  2018-03-15     West  Timothy    Stephen    Television   56.00    1198.000
5  2018-04-01     East   Martha  Alexander  Home Theater   60.00     500.000
6  2018-04-18  Central   Martha     Steven    Television   75.00    1198.000
7  2018-05-05  Central  Hermann       Luis    Television   90.00    1198.000
8  2018-05-22     West  Douglas    Michael    Television   32.00    1198.000
9  2018-06-08     East   Martha  Alexander  Home Theater   60.00     500.000
10 2018-06-25  Central  Hermann      Sigal    Television   90.00    1198.000
11 2018-07-12     East   Martha      Diana  Home Theater   29.00     500.000
12 2018-07-29     East  Douglas      Karen  Home Theater   81.00     500.000
13 2018-08-15     East   Martha  Alexander    Television   35.00    1198.000
14 2018-09-01  Central  Douglas       John          Desk    2.00     125.000
15 2018-09-18     East   Martha  Alexander   Video Games   16.00      58.500
16 2018-10-05  Central  Hermann      Sigal  Home Theater   28.00     500.000
17 2018-10-22     East   Martha  Alexander    Cell Phone   64.00     225.000
18 2018-11-08     East  Douglas      Karen    Cell Phone   15.00     225.000
19 2018-11-25  Central  Hermann     Shelli   Video Games   96.00      58.500
20 2018-12-12  Central  Douglas       John    Television   67.00    1198.000
21 2018-12-29     East  Douglas      Karen   Video Games   74.00      58.500
22 2019-01-15  Central  Timothy      David  Home Theater   46.00     500.000
23 2019-02-01  Central  Douglas       John  Home Theater   87.00     500.000
24 2019-02-18     East   Martha  Alexander  Home Theater    4.00     500.000
25 2019-03-07     West  Timothy    Stephen  Home Theater    7.00     500.000
26 2019-03-24  Central  Hermann       Luis   Video Games   50.00      58.500
27 2019-04-10  Central   Martha     Steven    Television   66.00    1198.000
28 2019-04-27     East   Martha      Diana    Cell Phone   96.00     225.000
29 2019-05-14  Central  Timothy      David    Television   53.00    1198.000
30 2019-05-31  Central  Timothy      David  Home Theater   80.00     500.000
31 2019-06-17  Central  Hermann     Shelli          Desk    5.00     125.000
32 2019-07-04     East   Martha  Alexander   Video Games   62.00      58.500
33 2019-07-21  Central  Hermann      Sigal   Video Games   55.00      58.500
34 2019-08-07  Central  Hermann     Shelli   Video Games   42.00      58.500
35 2019-08-24     West  Timothy    Stephen          Desk    3.00     125.000
36 2019-09-10  Central  Timothy      David    Television    7.00    1198.000
37 2019-09-27     West  Timothy    Stephen    Cell Phone   76.00     225.000
38 2019-10-14     West  Douglas    Michael  Home Theater   57.00     500.000
39 2019-10-31  Central   Martha     Steven    Television   14.00    1198.000
40 2019-11-17  Central  Hermann       Luis  Home Theater   11.00     500.000
41 2019-12-04  Central  Hermann       Luis  Home Theater   94.00     500.000
42 2019-12-21  Central   Martha     Steven  Home Theater   28.00     500.000
43        NaT      NaN      NaN        NaN           NaN  278.00    1125.000
44        NaT      NaN      NaN        NaN           NaN   34.75     140.625

     Sale_amt
0   113810.00
1    25000.00
2    43128.00
3     6075.00
4    67088.00
5    30000.00
6    89850.00
7   107820.00
8    38336.00
9    30000.00
10  107820.00
11   14500.00
12   40500.00
13   41930.00
14     250.00
15     936.00
16   14000.00
17   14400.00
18    3375.00
19    5616.00
20   80266.00
21    4329.00
22   23000.00
23   43500.00
24    2000.00
25    3500.00
26    2925.00
27   79068.00
28   21600.00
29   63494.00
30   40000.00
31     625.00
32    3627.00
33    3217.50
34    2457.00
35     375.00
36    8386.00
37   17100.00
38   28500.00
39   16772.00
40    5500.00
41   47000.00
42   14000.00
43   62550.00
44    7818.75

[notice] A new release of pip is available: 23.0.1 -> 24.1.1
[notice] To update, run: C:\Users\kamal\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

NameError: name 'df' is not defined